#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖``
<details><summary>Show Plan</summary>
```terraform
data.archive_file.sre-grafana-lambda: Reading...
data.archive_file.sre-grafana-lambda: Read complete after 0s [id=6f4c968024db808eee8e00ff2b543f9c7f27b798]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.dlq_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "dlq_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when the DLQ for the sre-grafana-lambda function reaches 1 message."
      + alarm_name                            = "sre-grafana-lambda-dlq-alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Julia Paiva"
          + "Project"   = "SRE-GRAFANA"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_iam_role.sre-grafana-lambda-role will be created
  + resource "aws_iam_role" "sre-grafana-lambda-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sre-grafana-lambda-role"
      + path                  = "/"
      + tags_all              = {
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Julia Paiva"
          + "Project"   = "SRE-GRAFANA"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.lambda_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "sre-grafana-lambda-role"
    }

  # aws_iam_role_policy_attachment.lambda_sqs_send will be created
  + resource "aws_iam_role_policy_attachment" "lambda_sqs_send" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSQSFullAccess"
      + role       = "sre-grafana-lambda-role"
    }

  # aws_lambda_function.sre-grafana-lambda will be created
  + resource "aws_lambda_function" "sre-grafana-lambda" {
      + arn                            = (known after apply)
      + filename                       = "./sre-grafana-lambda.zip"
      + function_name                  = "sre-grafana-lambda"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Julia Paiva"
          + "Project"   = "SRE-GRAFANA"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.sns_invoke_lambda_permission will be created
  + resource "aws_lambda_permission" "sns_invoke_lambda_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = (known after apply)
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromSNS"
    }

  # aws_sns_topic.notification_topic will be created
  + resource "aws_sns_topic" "notification_topic" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "sre-grafana-lambda-notifications"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags_all                    = {
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Julia Paiva"
          + "Project"   = "SRE-GRAFANA"
        }
    }

  # aws_sns_topic.sre-grafana-sns-topic will be created
  + resource "aws_sns_topic" "sre-grafana-sns-topic" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "sre-grafana-sns-topic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags_all                    = {
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Julia Paiva"
          + "Project"   = "SRE-GRAFANA"
        }
    }

  # aws_sns_topic_subscription.sre-grafana-lambda-sns_topic_subscription will be created
  + resource "aws_sns_topic_subscription" "sre-grafana-lambda-sns_topic_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sqs_queue.dlq will be created
  + resource "aws_sqs_queue" "dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "sre-grafana-lambda-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags_all                          = {
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Julia Paiva"
          + "Project"   = "SRE-GRAFANA"
        }
      + visibility_timeout_seconds        = 30
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @juliavpaiva, Action: `pull_request`, Working Directory: `infrastructure/terraform/main`, Workflow: `Plan Terraform Main`*